{
  "facts": [
    {
      "id": "rule-no-hallucination",
      "type": "rule",
      "title": "Правило против выдумывания",
      "content": "Если данных недостаточно — говори, что нужны уточнения (район, улица, число коек, сменность школы, наличие парковки). Не выдумывай цифры. Давай причинно-следственный ответ и список факторов, которые меняют результат."
    },

    {
      "id": "traffic-peak-school",
      "type": "transport",
      "title": "Пики у школ",
      "content": "Школы создают короткие, но резкие пики трафика утром и после уроков: высадка/подбор детей, двойные парковки, развороты, повышенная доля пеших переходов, снижение средней скорости на 100–300 м вокруг входов."
    },
    {
      "id": "traffic-peak-hospital",
      "type": "transport",
      "title": "Пики у больниц",
      "content": "Больницы создают более растянутый спрос: плановые посещения (днём), смены персонала (утро/вечер), экстренные подъезды (скорые), высокая доля такси/частного транспорта, регулярные остановки 'на минуту' и ожидание у входа."
    },
    {
      "id": "conflict-school-hospital",
      "type": "transport",
      "title": "Конфликт потоков школа + больница",
      "content": "Если больница рядом со школой, пики накладываются: персонал/посетители больницы + школьные высадки. Это усиливает заторы на ближайших перекрёстках и у въездов/выездов, особенно если нет карманов для остановки, отдельного въезда скорых и нормальной парковки."
    },
    {
      "id": "access-design",
      "type": "planning",
      "title": "Доступность и въезды",
      "content": "Ключ к снижению пробок — разнести потоки: отдельный въезд для скорых, отдельный въезд/выезд для посетителей, отдельная зона 'drop-off' для школы, запрет остановки вдоль главной улицы, карманы/заезды и понятная схема движения."
    },
    {
      "id": "parking-demand",
      "type": "transport",
      "title": "Парковка как причина заторов",
      "content": "Недостаток парковки приводит к 'кругам' в поиске места, стихийной остановке на проезжей части и блокировке полосы. Для больницы критично предусмотреть гостевую парковку и кратковременные места у входа."
    },
    {
      "id": "pedestrian-safety",
      "type": "safety",
      "title": "Пешеходы и безопасность",
      "content": "Рядом со школой растёт число пешеходов и переходов, поэтому скорость ниже и больше задержек на переходах. Для больницы добавляется поток маломобильных граждан, которым нужны пандусы, широкие тротуары и безопасные пересечения."
    },
    {
      "id": "public-transport-effect",
      "type": "transport",
      "title": "Общественный транспорт снижает нагрузку",
      "content": "Если к объекту есть удобный ОТ (остановки близко, частота, безопасный подход), доля личных авто меньше, а пробки слабее. Но остановка ОТ у входа без кармана может наоборот тормозить поток."
    },

    {
      "id": "evaluation-framework",
      "type": "analysis",
      "title": "Как отвечать на 'что будет если'",
      "content": "Оцени по блокам: 1) генерация поездок (кто и когда едет), 2) узкие места (въезды, перекрёстки, парковка), 3) безопасность (пешеходы/скорые), 4) меры смягчения (организация движения, ОТ, парковка), 5) ожидаемый эффект по KPI (скорость, задержки, безопасность, выбросы)."
    }
  ],

  "scenarios": [
    {
      "id": "sc-hospital-near-school-basic",
      "title": "Если построить больницу рядом со школой",
      "trigger": "больниц* рядом со школ* пробк*",
      "answer": "Да, вероятность пробок высокая, потому что у школы есть резкие пики высадки/подбора, а у больницы — постоянный поток посетителей и смены персонала. Пики могут накладываться, и тогда ближайшие перекрёстки и въезды перегружаются. Главные причины: остановка 'на минуту' у входа, поиск парковки, двойные парковки, пешеходные переходы у школы и частые манёвры разворота. Чтобы не получить затор, нужны: отдельный подъезд для скорых, отдельный въезд/выезд для посетителей, карманы для посадки/высадки у школы, запрет остановки вдоль главной улицы, достаточная парковка и безопасные переходы.",
      "followup_questions": [
        "Сколько коек/посещений в день у больницы (примерно)?",
        "Сколько смен у школы и есть ли подвоз на авто/автобусах?",
        "Какая улица/перекрёсток рядом и сколько полос?",
        "Есть ли возможность сделать отдельный въезд для скорых?"
      ],
      "kpi_effects": {
        "avg_speed": "скорее снизится в радиусе 100–300 м в часы пик",
        "delay": "скорее увеличится на ближайших перекрёстках",
        "safety": "риски выше из-за смешения пешеходов и подъезда авто/скорых",
        "air_quality": "может ухудшиться локально из-за стояния/разгонов"
      }
    },

    {
      "id": "sc-hospital-near-school-mitigations",
      "title": "Как сделать, чтобы пробки НЕ выросли (школа + больница)",
      "trigger": "как уменьшить пробк* школ* больниц*",
      "answer": "Снижение пробок делается организацией потоков: 1) разнести въезды (скорая/посетители/персонал), 2) сделать drop-off карман у школы (без остановки на полосе), 3) односторонняя схема вокруг входа (если возможно), 4) парковка: кратковременная у входа + основная отдельным карманом, 5) безопасные переходы: островки, светофор/приоритет пешеходам там, где нужно, 6) остановку ОТ вынести так, чтобы автобус не блокировал полосу, 7) окно разгрузки/подвоза (график поставок и спецтранспорта вне школьного пика)."
    },

    {
      "id": "sc-emergency-access",
      "title": "Пробки и доступ скорой",
      "trigger": "скорая* не проедет|доступ скорой|подъезд скорой",
      "answer": "Самый критичный риск рядом со школой — скорой трудно подъехать из-за хаотичной остановки и узких проездов. Решение: выделенный въезд/полоса или физически отделённый подъезд, запрет парковки по маршруту скорой, радиусы разворота, свободный карман у приёмного покоя и правило 'никаких остановок' на участке подъезда."
    },

    {
      "id": "sc-parking-shortstop",
      "title": "Пробки из-за коротких остановок у входа",
      "trigger": "останов* у входа|подъехал на минуту|такси у входа",
      "answer": "Короткие остановки у входа часто дают больший эффект, чем недостаток полос: машина встаёт на полосу, поток ломается, возникает 'гармошка'. Решение: карман для кратковременной остановки, отдельная зона такси/высадки, физические ограничители от остановки на проезжей части."
    },

    {
      "id": "sc-public-transport-balance",
      "title": "Если добавить остановку ОТ рядом",
      "trigger": "остановк* автобуса|общественн* транспорт рядом",
      "answer": "ОТ может уменьшить долю личных авто (меньше пробок), но если остановка без кармана — автобус будет блокировать полосу и делать затор. Хороший вариант: остановка с заездным карманом + безопасный путь пешком + удобная пересадка."
    }
  ],

  "city_context": {
    "city": "Oskemen (Ust-Kamenogorsk)",
    "focus": "Smart City / Digital Twin: транспорт, инженерные сети, зелёные зоны, качество воздуха, безопасность",
    "notes": "Если пользователь не указал улицу/район, отвечай общими принципами, а затем попроси 2-4 уточнения. Не придумывай конкретные цифры по городу без источника."
  }
}
